## Îç∞Ïù¥ÌÑ∞ ÌÜµÌï©

### ÏÑ∏Î°ú Î∞©Ìñ• ÌÜµÌï©

```
DataFrame_data1.append(DataFrame_data2 [,ignore_index=True])
```

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [3]:
df2 = pd.DataFrame({'Class1':[87, 89],
                    'Class2':[85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [4]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

Í∑∏Îü∞Îç∞ Î≥¥Î©¥ Ïù∏Îç±Ïä§ Î≤àÌò∏Í∞Ä Í∑∏ÎåÄÎ°ú ÌÜµÌï©Ïù¥ ÎêòÏóàÎã§  
Ïù¥Í≤ÉÏùÑ Ìï¥Í≤∞ÌïòÎ†§Î©¥ ÏïÑÎûòÏùò ÏΩîÎìúÎ•º Ï∂îÍ∞ÄÌï¥Ï§ÄÎã§
```
ignore_index=True
```

In [5]:
df1.append(df2,ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

**üòÜüëç**

ÎßåÏïΩ Îëê DataFrameÏùò columns ÏàòÍ∞Ä Í∞ôÏßÄ ÏïäÎã§Î©¥ ÏóÜÎäî Î∂ÄÎ∂ÑÏùÄ NaN ÏúºÎ°ú Ï±ÑÏõåÏßÑÎã§

In [6]:
df3 = pd.DataFrame({'Class1':[96,83]})
df3

   Class1
0      96
1      83

In [7]:
df2.append(df3, ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

### Í∞ÄÎ°ú Î∞©Ìñ• ÌÜµÌï©

```
DataFrame_data1.join(DataFrame_data2)
```

In [8]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [9]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

index ÎùºÎ≤®ÏùÑ ÏßÄÏ†ïÌïú Í≤ΩÏö∞ÏóêÎèÑ indexÍ∞Ä Í∞ôÏúºÎ©¥ join() ÏÇ¨Ïö© Í∞ÄÎä•

In [10]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                     'Class2': [91, 93, 97, 99]}, index=index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

index ÌÅ¨Í∏∞Í∞Ä Îã§Î•¥Î©¥ append ÏôÄ ÎßàÏ∞¨Í∞ÄÏßÄÎ°ú NaN ÏúºÎ°ú Ï±ÑÏõåÏßÑÎã§

In [11]:
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

   Class4
0      82
1      92

In [12]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

### ÌäπÏ†ï Ïó¥ÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÌÜµÌï©

```
DataFrame_left_data.merge(DataFrame_right_data)
```

Ïù¥Î•º ÏàòÌñâÌïòÎ©¥ `ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞`ÏôÄ `Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞`Í∞Ä Í≥µÌÜµÎêú Ïó¥ÏùÑ Ï§ëÏã¨ÏúºÎ°ú ÌÜµÌï©ÎêúÎã§

In [13]:
df_A_B = pd.DataFrame({'ÌåêÎß§Ïõî':['1Ïõî','2Ïõî','3Ïõî','4Ïõî'],
                       'Ï†úÌíàA':[100,150,200,130],
                       'Ï†úÌíàB':[90,110,140,170]})
df_A_B

  ÌåêÎß§Ïõî  Ï†úÌíàA  Ï†úÌíàB
0  1Ïõî  100   90
1  2Ïõî  150  110
2  3Ïõî  200  140
3  4Ïõî  130  170

In [14]:
df_C_D = pd.DataFrame({'ÌåêÎß§Ïõî':['1Ïõî','2Ïõî','3Ïõî','4Ïõî'],
                       'Ï†úÌíàC ':[112, 141, 203, 134],
                       'Ï†úÌíàD' :[90, 110, 140, 170]})
df_C_D

  ÌåêÎß§Ïõî  Ï†úÌíàC   Ï†úÌíàD
0  1Ïõî   112   90
1  2Ïõî   141  110
2  3Ïõî   203  140
3  4Ïõî   134  170

In [15]:
df_A_B.merge(df_C_D)

  ÌåêÎß§Ïõî  Ï†úÌíàA  Ï†úÌíàB  Ï†úÌíàC   Ï†úÌíàD
0  1Ïõî  100   90   112   90
1  2Ïõî  150  110   141  110
2  3Ïõî  200  140   203  140
3  4Ïõî  130  170   134  170

### ÎëêÍ∞úÏùò Îç∞Ïù¥ÌÑ∞Í∞Ä ÌäπÏ†ï Ïó¥ÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÏùºÎ∂ÄÎßå Í≥µÌÜµÎêú Í∞íÏùÑ Í∞ñÎäî Í≤ΩÏö∞

In [ ]:
```
DataFrame_left_data.merge(DataFrame_right_data, how=merge_method, on=key_label)
```

on Ïù∏ÏûêÏóê ÌÜµÌï©ÌïòÎ†§Îäî Í∏∞Ï§ÄÏù¥ ÎêòÎäî ÌäπÏ†ï Ïó¥Ïùò ÎùºÎ≤® Ïù¥Î¶ÑÏùÑ ÏûÖÎ†•,  
ÏûÖÎ†•ÌïòÏßÄ ÏïäÏùÑ Ïãú ÏûêÎèôÏúºÎ°ú Í≥µÌÜµÏ†ÅÏúºÎ°ú Ìè¨Ìï®Îêú Ïó¥Ïù¥ ÏÑ†ÌÉùÎêúÎã§  

how Ïù∏ÏûêÏóêÎäî ÏßÄÏ†ïÎêú ÌäπÏ†ï Ïó¥ÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÌÜµÌï© Î∞©Î≤ïÏùÑ ÏßÄÏ†ïÌïúÎã§

left : ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞Îäî Î™®Îëê ÏÑ†ÌÉù, ÏßÄÏ†ïÎêú Ïó¥Ïóê Í∞íÏù¥ ÏûàÎäî Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞Î•º ÏÑ†ÌÉù  

right : Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞Îäî Î™®Îëê ÏÑ†ÌÉùÌïòÍ≥† ÏßÄÏ†ïÎêú Ïó¥Ïóê Í∞íÏù¥ ÏûàÎäî ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞Î•º ÏÑ†ÌÉù

outer : ÏßÄÏ†ïÎêú Ïó¥ÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÏôºÏ™ΩÍ≥º Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞Î•º Î™®Îëê ÏÑ†ÌÉù  

inner : ÏßÄÏ†ïÎêú Ïó¥ÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÏôºÏ™ΩÍ≥º Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ Ï§ë Í≥µÌÜµ Ìï≠Î™©Îßå ÏÑ†ÌÉù

In [16]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [17]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [18]:
df_left.merge(df_right, how='left', on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [20]:
df_left.merge(df_right, how='right',on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [21]:
df_left.merge(df_right,how='outer',on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [22]:
df_left.merge(df_right, how='inner', on='key')

  key  left  right
0   A     1      4
1   B     2      5